IDEA Open Model
Vector3D.X Property
 Gets or sets the X-dirrection value
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
public:
property double X {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Vector3D Class
IdeaRS.OpenModel.Geometry3D Namespace